In [1]:
# If you dont have it already, download and install docker:

#   https://docs.docker.com/get-docker/

# Once installed, start docker by clicking the icon in your applications folder.

# Once installed, start by pulling latest postgres docker container.
# See below for more info about Postgres docker container: 

#   https://hub.docker.com/_/postgres

!docker pull postgres

Using default tag: latest
latest: Pulling from library/postgres
Digest: sha256:e3d8179786b8f16d066b313f381484a92efb175d1ce8355dc180fee1d5fa70ec
Status: Image is up to date for postgres:latest
docker.io/library/postgres:latest

In [2]:
# Now that we have installed the container, lets run it!

!docker run --name movies -e POSTGRES_PASSWORD=temp_password -d -p 5433:5432 postgres

docker: Error response from daemon: Conflict. The container name "/movies" is already in use by container "9dabefea8f7fabc00f7be9317734fcbdae2f73d87b77197e24dd8c2e2da9472a". You have to remove (or rename) that container to be able to reuse that name.
See 'docker run --help'.

In [3]:
import pandas as pd

In [44]:
# Load movies dataset into a data frame.
movies_df = pd.read_csv('movies.csv') 
movies_df.tail()

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,runtime
7663,More to Life,NaN,Drama,2020,"October 23, 2020 (United States)",3.1,18.0,Joseph Ebanks,Joseph Ebanks,Shannon Bond,United States,7000.0,NaN,NaN,90.0
7664,Dream Round,NaN,Comedy,2020,"February 7, 2020 (United States)",4.7,36.0,Dusty Dukatz,Lisa Huston,Michael Saquella,United States,NaN,NaN,Cactus Blue Entertainment,90.0
7665,Saving Mbango,NaN,Drama,2020,"April 27, 2020 (Cameroon)",5.7,29.0,Nkanya Nkwai,Lynno Lovert,Onyama Laura,United States,58750.0,NaN,Embi Productions,NaN
7666,It's Just Us,NaN,Drama,2020,"October 1, 2020 (United States)",NaN,NaN,James Randall,James Randall,Christina Roz,United States,15000.0,NaN,NaN,120.0
7667,Tee em el,NaN,Horror,2020,"August 19, 2020 (United States)",5.7,7.0,Pereko Mosia,Pereko Mosia,Siyabonga Mabaso,South Africa,NaN,NaN,PK 65 Films,102.0

In [5]:
# Load inflation indexer data
inflation_df = pd.read_csv('CPIAUCNS.csv')
inflation_df.head()

         DATE CPIAUCNS_NBD20210101
0  1913-01-01              3.64739
1  1914-01-01              3.69660
2  1915-01-01              3.73043
3  1916-01-01              4.01644
4  1917-01-01              4.73300

In [6]:
# add the dataset to Postgres.

#import to PostgresSQL
from sqlalchemy import create_engine

# create a database engine
engine = "postgresql://postgres:temp_password@127.0.0.1:5433/postgres"

# Using temp dev password.
db_password = 'temp_password'

#connection string
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5433/postgres"

#database engine
engine = create_engine(db_string)

#importing movie data
movies_df.to_sql(name='movies', con=engine, if_exists='replace', index=False)

#importing inflation data
inflation_df.to_sql(name='inflation', con=engine, if_exists='replace', index=False)

In [7]:
# Now lets check to see if it worked...

query = """

SELECT 
    *
FROM
    movies
WHERE 
    director = 'John Carpenter'
ORDER BY
    score DESC

"""
test_movies_df = pd.read_sql_query(query, con=engine)
test_movies_df.head()

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,runtime
0,The Thing,R,Horror,1982,"June 25, 1982 (United States)",8.1,382000.0,John Carpenter,Bill Lancaster,Kurt Russell,United States,15000000.0,19632053.0,Universal Pictures,109.0
1,They Live,R,Action,1988,"November 4, 1988 (United States)",7.3,117000.0,John Carpenter,Ray Nelson,Roddy Piper,United States,4000000.0,13008928.0,Alive Films,94.0
2,Big Trouble in Little China,PG-13,Action,1986,"July 2, 1986 (United States)",7.3,128000.0,John Carpenter,Gary Goldman,Kurt Russell,United States,25000000.0,11100577.0,Twentieth Century Fox,99.0
3,Escape from New York,R,Action,1981,"July 10, 1981 (United States)",7.2,131000.0,John Carpenter,John Carpenter,Kurt Russell,United States,6000000.0,25244626.0,AVCO Embassy Pictures,99.0
4,In the Mouth of Madness,R,Drama,1994,"February 3, 1995 (United States)",7.2,64000.0,John Carpenter,Michael De Luca,Sam Neill,United States,8000000.0,8924549.0,New Line Cinema,95.0

In [8]:
# Now lets check to see if it worked...

query = """

SELECT 
    *
FROM
    inflation


"""
test_inflation_df = pd.read_sql_query(query, con=engine)
test_inflation_df.head()

         DATE CPIAUCNS_NBD20210101
0  1913-01-01              3.64739
1  1914-01-01              3.69660
2  1915-01-01              3.73043
3  1916-01-01              4.01644
4  1917-01-01              4.73300

In [9]:
# Created a cleaned table without budget, release date, no NULLS and 'unnamed' 

query = """

DROP TABLE IF EXISTS movies_clean;

CREATE TABLE movies_clean AS (
    SELECT 
        name, 
        rating, 
        genre, 
        year, 
        score, 
        votes, 
        director, 
        writer, 
        star, 
        country, 
        gross, 
        company, 
        runtime 
    FROM 
        movies
        
    WHERE
        movies IS NOT NULL
        
);

SELECT *
FROM movies_clean; 

"""
movies_clean = pd.read_sql_query(query, con=engine)
movies_clean.head()

,name,rating,genre,year,score,votes,director,writer,star,country,gross,company,runtime
0,The Shining,R,Drama,1980,8.4,927000.0,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,46998772.0,Warner Bros.,146.0
1,The Blue Lagoon,R,Adventure,1980,5.8,65000.0,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,58853106.0,Columbia Pictures,104.0
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,8.7,1200000.0,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,538375067.0,Lucasfilm,124.0
3,Airplane!,PG,Comedy,1980,7.7,221000.0,Jim Abrahams,Jim Abrahams,Robert Hays,United States,83453539.0,Paramount Pictures,88.0
4,Caddyshack,R,Comedy,1980,7.3,108000.0,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,39846344.0,Orion Pictures,98.0

In [31]:
# Created inflation table  

query = """

DROP TABLE IF EXISTS inflation_clean;

CREATE TABLE inflation_clean AS (
    SELECT 
        LEFT("DATE"::VARCHAR,4)::INT AS YEAR,
        "CPIAUCNS_NBD20210101"::FLOAT8 AS INFLATION_ADJUSTMENT,
        100.0/"CPIAUCNS_NBD20210101"::FLOAT AS CPI_MULTIPLIER
    FROM 
        inflation
        
    WHERE 1=1
        AND inflation IS NOT NULL
        AND "CPIAUCNS_NBD20210101" != '.'
);

SELECT *
    
FROM inflation_clean; 

"""
inflation_clean = pd.read_sql_query(query, con=engine)
inflation_clean.head()

   year  inflation_adjustment  cpi_multiplier
0  1913               3.64739       27.416865
1  1914               3.69660       27.051886
2  1915               3.73043       26.806561
3  1916               4.01644       24.897671
4  1917               4.73300       21.128248

In [48]:
#merged movies and inflation datasets into a table 
query = """

DROP TABLE IF EXISTS inflation_adjusted_movie_data;

CREATE TABLE inflation_adjusted_movie_data AS (

    SELECT 
        movies_clean.name,
        movies_clean.year,
        movies_clean.rating, 
        movies_clean.genre,
        movies_clean.score,
        movies_clean.votes,
        movies_clean.director, 
        movies_clean.writer,
        movies_clean.star,
        movies_clean.company,
        movies_clean.country,
        movies_clean.gross,
        movies_clean.runtime,
        inflation_clean.inflation_adjustment,
        inflation_clean.cpi_multiplier
    FROM movies_clean
    INNER JOIN
        inflation_clean
    ON
        movies_clean.year = inflation_clean.year);
    
SELECT *
    
FROM inflation_adjusted_movie_data; 

"""
inflation_adjusted_movie_data = pd.read_sql_query(query, con=engine)
inflation_adjusted_movie_data.tail()

,name,year,rating,genre,score,votes,director,writer,star,company,country,gross,runtime,inflation_adjustment,cpi_multiplier
5416,Bad Boys for Life,2020,R,Action,6.6,140000.0,Adil El Arbi,Peter Craig,Will Smith,Columbia Pictures,United States,426505244.0,124.0,95.51294,1.046979
5417,Sonic the Hedgehog,2020,PG,Action,6.5,102000.0,Jeff Fowler,Pat Casey,Ben Schwartz,Paramount Pictures,United States,319715683.0,99.0,95.51294,1.046979
5418,Dolittle,2020,PG,Adventure,5.6,53000.0,Stephen Gaghan,Stephen Gaghan,Robert Downey Jr.,Universal Pictures,United States,245487753.0,101.0,95.51294,1.046979
5419,The Call of the Wild,2020,PG,Adventure,6.8,42000.0,Chris Sanders,Michael Green,Harrison Ford,20th Century Studios,Canada,111105497.0,100.0,95.51294,1.046979
5420,The Eight Hundred,2020,Not Rated,Action,6.8,3700.0,Hu Guan,Hu Guan,Zhi-zhong Huang,Beijing Diqi Yinxiang Entertainment,China,461421559.0,149.0,95.51294,1.046979

In [49]:
#Which studio produces the highest rated movies in the US
query = """

SELECT 
    company, 
    AVG(score) AS avg_score
FROM
    inflation_adjusted_movie_data
WHERE
    country='United States'

GROUP BY
    1
ORDER BY
    avg_score DESC

"""
company_movies_df = pd.read_sql_query(query, con=engine)
company_movies_df.head(10)

                         company  avg_score
0  Strong Heart/Demme Production        8.6
1           Cecchi Gori Pictures        8.6
2        Newmarket Capital Group        8.4
3                           AMLF        8.3
4           Red Granite Pictures        8.2
5              FortyFour Studios        8.1
6       Truth Entertainment (II)        8.0
7                 Pandora Cinema        8.0
8       Faliro House Productions        7.9
9    Electric City Entertainment        7.9

In [51]:
#which genre is the most popular gobally
query = """

SELECT 
    genre, 
    AVG(score) AS avg_score
FROM
    inflation_adjusted_movie_data


GROUP BY
    1
ORDER BY
    avg_score DESC

"""
genre_movies_df = pd.read_sql_query(query, con=engine)
genre_movies_df.head()

       genre  avg_score
0  Biography   7.088103
1      Drama   6.721437
2  Animation   6.690614
3      Crime   6.689223
4     Family   6.675000

In [52]:
#Directors affect ratings in the US
query = """

SELECT 
    director, 
    AVG(score) AS avg_score
FROM
    inflation_adjusted_movie_data
WHERE
    country='United States'

GROUP BY
    1
ORDER BY
    avg_score DESC

"""
director_movies_df = pd.read_sql_query(query, con=engine)
director_movies_df.head()

            director  avg_score
0          Tony Kaye   8.500000
1    Bob Persichetti   8.400000
2        Lee Unkrich   8.300000
3  Christopher Nolan   8.233333
4        Pete Docter   8.133333

In [53]:
#actors affect ratings in the US
query = """

SELECT 
    star, 
    AVG(score) AS avg_score
FROM
    inflation_adjusted_movie_data
WHERE
    country='United States'

GROUP BY
    1
ORDER BY
    avg_score DESC

"""
star_movies_df = pd.read_sql_query(query, con=engine)
star_movies_df.head()

                   star  avg_score
0           Mark Hamill        8.5
1             Ben Burtt        8.4
2      Anthony Gonzalez        8.4
3  Dean-Charles Chapman        8.3
4     F. Murray Abraham        8.3